
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.redis6_connection_string
* Replace
  * module.redis6-cache.azurerm_private_endpoint.this[0]
  * module.redis6-cache.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis6_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis6_connection_string" {
        id                      = "https://rpx-aat.vault.azure.net/secrets/webapp-redis6-connection-string/34966ae89a3c4b0bb8568cd448111146"
        name                    = "webapp-redis6-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.redis6-cache.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat/providers/Microsoft.Network/privateEndpoints/rpx-mc-redis6-aat" -> (known after apply)
        name                     = "rpx-mc-redis6-aat"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat/providers/Microsoft.Network/networkInterfaces/rpx-mc-redis6-aat.nic.43a8c10b-a0dc-44f9-8bf6-d01608fa8021"
              - name = "rpx-mc-redis6-aat.nic.43a8c10b-a0dc-44f9-8bf6-d01608fa8021"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat/providers/Microsoft.Network/privateEndpoints/rpx-mc-redis6-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "xui-webapp-aat.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.96.136.23",
                        ]
                      - name         = "xui-webapp-aat"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"         = "expert-ui"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#xui-pipeline"
            "environment"         = "staging"
            "managedBy"           = "Expert UI"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat/providers/Microsoft.Network/privateEndpoints/rpx-mc-redis6-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> (known after apply)
            name                 = "redis-endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "rpx-mc-redis6-aat"
          ~ private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat/providers/Microsoft.Cache/redis/xui-webapp-aat" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.96.136.23" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.redis6-cache.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ capacity                      = 2 -> 3
      ~ family                        = "P" -> "C"
      ~ hostname                      = "xui-webapp-aat.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat/providers/Microsoft.Cache/redis/xui-webapp-aat" -> (known after apply)
        name                          = "xui-webapp-aat"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ sku_name                      = "Premium" -> "Standard" # forces replacement
      ~ ssl_port                      = 6380 -> (known after apply)
        tags                          = {
            "application"         = "expert-ui"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#xui-pipeline"
            "environment"         = "staging"
            "managedBy"           = "Expert UI"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (5 unchanged attributes hidden)

      ~ redis_configuration {
          - active_directory_authentication_enabled = false -> null
          - aof_backup_enabled                      = false -> null
          ~ maxclients                              = 15000 -> (known after apply)
          ~ maxfragmentationmemory_reserved         = 1328 -> 642
          ~ maxmemory_delta                         = 1328 -> 642
          ~ maxmemory_reserved                      = 1328 -> 642
          - rdb_backup_enabled                      = false -> null
          - rdb_backup_frequency                    = 0 -> null
          - rdb_backup_max_snapshot_count           = 0 -> null
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":3591,"Program":"tfcmt","SHA1":"","Vars":{}} -->